guide/Sample XML.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://services.metlife.com/standards/svcinfo/v1" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:urn="urn:com.metlife.ead.channels.services.contract.contractV5" xmlns:pol="http://MetLife/CMM/Policy">
   <soapenv:Header>
      <v1:ServiceRequestInfo>
         <v1:RequestDateTime>12-12-2012T12:12:12</v1:RequestDateTime>
         <v1:RequestID>3009310474757219328</v1:RequestID>
         <v1:SessionID>RlSTzA23og_S4ubFAq-hCcZ</v1:SessionID>
         <v1:UserID UserType="UserID">User1</v1:UserID>
         <v1:UserID UserType="AppID">CCI_USA</v1:UserID>
      </v1:ServiceRequestInfo>
      <oas:Security>
         <oas:UsernameToken>
            <oas:Username>sample_UserName</oas:Username>
            <oas:Password>sample_Password</oas:Password>
         </oas:UsernameToken>
      </oas:Security>
   </soapenv:Header>
   <soapenv:Body>
      <urn:searchContractList>
         <pol:RequestHeader>
            <pol:UserId>usr1</pol:UserId>
            <pol:UserPswd>
               <pol:Pswd/>
            </pol:UserPswd>
            <pol:VendorApp>
               <pol:VendorName>SPS</pol:VendorName>
               <pol:Met_VendorAppType>SourceSystem</pol:Met_VendorAppType>
            </pol:VendorApp>
            <pol:ProxyVendor>
               <pol:VendorName>ESB</pol:VendorName>
               <pol:AppVer>2.0</pol:AppVer>
            </pol:ProxyVendor>
            <pol:Met_Multi_Tenancy>
               <pol:Nation>USA</pol:Nation>
            </pol:Met_Multi_Tenancy>
            <pol:TransTrackingID>T12345</pol:TransTrackingID>
            <pol:TransType>TCPAREPORT</pol:TransType>
            <pol:TransSubType>Service Info</pol:TransSubType>
            <pol:TransExeDate>12-12-2012</pol:TransExeDate>
            <pol:TransExeTime>12:12:12</pol:TransExeTime>
            <pol:MaxRecords/>
         </pol:RequestHeader>
         <pol:Search>
            <pol:CriteriaOperator/>
            <pol:CriteriaExpression>
               <pol:CriteriaOperator/>
               <pol:Criteria>
                  <pol:ObjectType>Met_PrivacyConsent</pol:ObjectType>
                  <pol:PropertyName>Met_PrivacyConsentEffDate</pol:PropertyName>
                  <pol:PropertyValue>2016-08-19</pol:PropertyValue>
                  <pol:Operation>EQUALS</pol:Operation>
                  <pol:ComparedObjectType>Party</pol:ComparedObjectType>
                  <pol:ComparedPropertyName/>
               </pol:Criteria>
               <pol:Criteria>
                  <pol:ObjectType>Met_PrivacyConsent</pol:ObjectType>
                  <pol:PropertyName>Met_PrivacyConsentExpDate</pol:PropertyName>
                  <pol:PropertyValue>2016-08-20</pol:PropertyValue>
                  <pol:Operation>EQUALS</pol:Operation>
                  <pol:ComparedObjectType>Party</pol:ComparedObjectType>
                  <pol:ComparedPropertyName/>
               </pol:Criteria>
            </pol:CriteriaExpression>
         </pol:Search>
      </urn:searchContractList>
   </soapenv:Body>
</soapenv:Envelope>
